       identification division.
           program-id. hello.
       data division.
       procedure division.

       program-begin.
           display "This program contains four DIVISIONS,".
           display "Three PARAGRAPHS".
           display "And four SENTENCES".
       program-done.
           stop run.
           

