       IDENTIFICATION DIVISION.
       PROGRAM-ID. CONSTANTS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
      **********************************************************
      * THIS IS A PROGRAM TO ILLUSTRATE THE USE OF CONSTANTS
      ************************************************ 
       PROGRAM-BEGIN.
           DISPLAY "THIS IS A STRING CONSTANT".
           DISPLAY 55.72.
       PROGRAM-END.
           STOP-RUN.
        