       IDENTIFICATION DIVISION.
       PROGRAM-ID. SENTENCES.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
       
       PROGRAM-BEGIN.      
           DISPLAY "THIS PROGRAM HAS 4 DIVISIONS".
           DISPLAY "THREE PARAGRAPHS".
           DISPLAY "AND FOUR SENTENCES".
       PROGRAM-END.   
           STOP RUN.
